Omgitskillah/nrf52832_bno055_ble/lib/ble_uart/ble_uart_peripheral/ble_uart_peripheral.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
#ifdef LOG_BLE_UART_PERIPHERAL    
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
#endif
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
#ifdef LOG_BLE_UART_PERIPHERAL    
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
#endif
// don't let one app manage power when in idle state    
//    nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


void ble_uart_peripheral_print_to_uart(uint8_t * _string, uint32_t _len)
{
    uint32_t err_code;

    for (uint32_t i = 0; i < _len; i++)
     {
         if(_string[i] == '\n') break;
         do        
         {
            err_code = app_uart_put(_string[i]);
            if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
            {
#ifdef LOG_BLE_UART_PERIPHERAL                    
                NRF_LOG_ERROR("Failed write to UART. Error 0x%x. ", err_code);
#endif                    
                APP_ERROR_CHECK(err_code);
            }
         } while (err_code == NRF_ERROR_BUSY);
    }
    while (app_uart_put('\n') == NRF_ERROR_BUSY);
}

void ble_uart_peripheral_init(void)
{
    bool erase_bonds;

    // Initialize.
    uart_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
}

void ble_uart_peripheral_advertising_start(void)
{
    advertising_start();
}

void ble_uart_peripheral_idle_state_handle(void)
{
    idle_state_handle();
}

void ble_uart_peripheral_send_to_ble(uint8_t * _string, uint16_t data_len)
{
    ret_code_t err_code;
    do
    {
        err_code = ble_nus_data_send(&m_nus, _string, &data_len, m_conn_handle);
        if ((err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_NOT_FOUND))
        {
            APP_ERROR_CHECK(err_code);
        }
    } while (err_code == NRF_ERROR_RESOURCES);    
}


/**
 * @}
 */
